In [151]:
#pip install pypyodbc

#   Uploading csv files to ssms

In [152]:
import pypyodbc  as odbc
import pandas as pd

In [153]:
#pip install pyodbc

In [154]:
import pyodbc
print(pyodbc.drivers())

['SQL Server', 'Microsoft Access Driver (*.mdb, *.accdb)', 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)', 'Microsoft Access Text Driver (*.txt, *.csv)', 'ODBC Driver 17 for SQL Server']

# connecting the ssms to python

In [155]:
import pyodbc

try:
    # Set autocommit=True to avoid wrapping in a transaction
    conn = pyodbc.connect(
        "DRIVER={ODBC Driver 17 for SQL Server};"
        "SERVER=DESKTOP-4H1OBGV\\MSSQLSERVER1;"
        "Trusted_Connection=yes;",
        autocommit=True
    )

    cursor = conn.cursor()
    cursor.execute("CREATE DATABASE pythonscenario")
    print("Database created successfully")

except Exception as e:
    print("Error:", e)

Error: ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Database 'pythonscenario' already exists. Choose a different database name. (1801) (SQLExecDirectW)")

In [156]:
import pandas as pd

df = pd.read_csv("Test3.csv")

df['registration_date'] = pd.to_datetime(df['registration_date'], format="%d-%m-%Y")


print(df.dtypes)
print(df['registration_date'].head())

customer_id                   int64
name                         object
email                        object
phone                        object
address                      object
registration_date    datetime64[ns]
loyalty_status               object
country_code                 object
CallingCode                   int64
dtype: object
0   2025-01-25
1   2023-07-13
2   2023-08-18
3   2024-12-08
4   2024-02-03
Name: registration_date, dtype: datetime64[ns]

In [157]:
df.head()

,customer_id,name,email,phone,address,registration_date,loyalty_status,country_code,CallingCode
0,1,Michelle Kidd,vayala@example.net,+971-6197234258,"USNS Santiago, FPO AE 80872",2025-01-25,Gold,AE,971
1,2,Brad Newton,taylorcatherine@example.net,+356-5376741158,"38783 Oliver Street, West Kristenborough, MT 9...",2023-07-13,Silver,MT,356
2,3,Larry Torres,dsanchez@example.net,+1-8102564505,"6845 Steele Turnpike, West Erikabury, UT 37487",2023-08-18,Bronze,UT,1
3,4,Kimberly Price,jessicaknight@example.com,+1-4232229779,"1631 Alexis Meadows, Lake Amanda, CA 75179",2024-12-08,Gold,CA,1
4,5,Matthew Phillips,qwilliams@example.com,+1-2207633522,"2274 Williams Heights Suite 895, Andersonhaven...",2024-02-03,Gold,OR,1

In [158]:
df.columns

Index(['customer_id', 'name', 'email', 'phone', 'address', 'registration_date',
       'loyalty_status', 'country_code', 'CallingCode'],
      dtype='object')

# creating table in ssms using python

In [175]:
import pyodbc

conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=DESKTOP-4H1OBGV\\MSSQLSERVER1;"
    "DATABASE=pythonscenario;"
    "Trusted_Connection=yes;"
)

cursor = conn.cursor()
cursor.execute("""
CREATE TABLE customer (
    customer_id INT,
    name VARCHAR(50),
    email VARCHAR(50),
    phone VARCHAR(50),
    address VARCHAR(100),
    registration_date DATE,
    loyalty_status VARCHAR(50),
    country_code VARCHAR(50),
    CallingCode INT
)
""")
conn.commit()
print("Customer table created successfully")

ProgrammingError: ('42S01', "[42S01] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]There is already an object named 'customer' in the database. (2714) (SQLExecDirectW)")

# inserting values into table using python and csv file

In [ ]:

for index, row in df.iterrows():
    cursor.execute("""
        INSERT INTO customer (
            customer_id,
            name,
            email,
            phone,
            address,
            registration_date,
            loyalty_status,
            country_code,
            CallingCode
        ) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
    """, (
        int(row['customer_id']),
        row['name'],
        row['email'],
        row['phone'],
        row['address'],
        row['registration_date'].strftime('%Y-%m-%d'),  #  formatted date
        row['loyalty_status'],
        row['country_code'],
        int(row['CallingCode'])
    ))

conn.commit()
print(" All rows inserted successfully into SQL Server.")

# Read the new csv file

In [ ]:
df1=pd.read_csv(r'transaction_cleaned.csv')

In [ ]:
df1.head()

In [ ]:
#pip install sqlalchemy

# Importing the tables from csv file to ssms

In [ ]:
import pandas as pd
from sqlalchemy import create_engine
import urllib
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=DESKTOP-4H1OBGV\\MSSQLSERVER1;"
    "DATABASE=pythonscenario;"
    "Trusted_Connection=yes;"
)


# Encode parameters for SQLAlchemy

engine = create_engine(  "mssql+pyodbc://DESKTOP-4H1OBGV\\MSSQLSERVER1/pythonscenario"
    "?driver=ODBC+Driver+17+for+SQL+Server"
    "&trusted_connection=yes")
 
# Load CSVs
transaction = pd.read_csv(r'transaction_cleaned.csv')
orders = pd.read_csv(r'order_data 1.csv')
 
 
#customer.to_sql('Customers', con=engine, if_exists='replace', index=False)
transaction.to_sql('transaction', con=engine, if_exists='replace', index=False)
orders.to_sql('orders', con=engine, if_exists='replace', index=False)

255

In [ ]:
import re

In [ ]:
df.describe()

       customer_id              registration_date  CallingCode
count  1000.000000                           1000  1000.000000
mean    500.500000  2024-06-25 16:39:21.600000256   165.925000
min       1.000000            2023-06-17 00:00:00     1.000000
25%     250.750000            2023-12-22 18:00:00     1.000000
50%     500.500000            2024-06-26 00:00:00     1.000000
75%     750.250000            2025-01-04 06:00:00   241.000000
max    1000.000000            2025-06-16 00:00:00   976.000000
std     288.819436                            NaN   283.319257

In [ ]:
df.head()

,customer_id,name,email,phone,address,registration_date,loyalty_status,country_code,CallingCode
0,1,Michelle Kidd,vayala@example.net,+971-6197234258,"USNS Santiago, FPO AE 80872",2025-01-25,Gold,AE,971
1,2,Brad Newton,taylorcatherine@example.net,+356-5376741158,"38783 Oliver Street, West Kristenborough, MT 9...",2023-07-13,Silver,MT,356
2,3,Larry Torres,dsanchez@example.net,+1-8102564505,"6845 Steele Turnpike, West Erikabury, UT 37487",2023-08-18,Bronze,UT,1
3,4,Kimberly Price,jessicaknight@example.com,+1-4232229779,"1631 Alexis Meadows, Lake Amanda, CA 75179",2024-12-08,Gold,CA,1
4,5,Matthew Phillips,qwilliams@example.com,+1-2207633522,"2274 Williams Heights Suite 895, Andersonhaven...",2024-02-03,Gold,OR,1

# Removing Prefix and Suffix from name

In [176]:
df['name']=df['name'].str.replace(r'^(mr|ms|miss|dr|er)\.?\s+', '',regex=True ,flags=re.IGNORECASE )
df['name']=df['name'].str.replace(r'^(Jr.| Sr.|md|dds|phd|iii|II|III|)\.?\s+', '',regex=True ,flags=re.IGNORECASE )

In [ ]:
df.loc[936]

customer_id                                                        937
name                                               Gregory Delgado III
email                                     sandovaljennifer@example.net
phone                                                    +1-5105814385
address              81588 Tiffany Circles Apt. 973, East Danielle,...
registration_date                                  2025-03-30 00:00:00
loyalty_status                                                  Bronze
country_code                                                        MS
CallingCode                                                          1
first_name                                                     Gregory
last_name                                                          III
Name: 936, dtype: object

In [ ]:
df['name']

0         Michelle Kidd
1           Brad Newton
2          Larry Torres
3        Kimberly Price
4      Matthew Phillips
             ...
995      Jerry Mcdaniel
996        Jodi Simpson
997       Crystal Brown
998      Gregory Duarte
999         Jason Walls
Name: name, Length: 1000, dtype: object

In [160]:
df['name']=df['name'].str.replace(r'^(mr|ms|mrs|dr|miss|mrs|prof)\.?\s+', '',regex=True ,flags=re.IGNORECASE )
df['name']=df['name'].str.replace(r'\b(jr|md|phd|dds|iii|dvm)\.?$', '',regex=True ,flags=re.IGNORECASE )

# Dividing name to first name and last name

In [163]:
df['first_name']=df['name'].str.split().str[0]
df['last_name'] = df['name'].str.split().str[-1]
df['last_name'].head(20)

0          Kidd
1        Newton
2        Torres
3         Price
4      Phillips
5     Gallagher
6        Miller
7      Galloway
8        Harvey
9         White
10         Yang
11      Delgado
12      Brennan
13       Thomas
14        Perez
15     Matthews
16     Alvarado
17         Dunn
18      Johnson
19      Morales
Name: last_name, dtype: object

In [164]:
df['first_name']
df['last_name']

0          Kidd
1        Newton
2        Torres
3         Price
4      Phillips
         ...
995    Mcdaniel
996     Simpson
997       Brown
998      Duarte
999       Walls
Name: last_name, Length: 1000, dtype: object

In [165]:
df.head()

,customer_id,name,email,phone,address,registration_date,loyalty_status,country_code,CallingCode,first_name,last_name
0,1,Michelle Kidd,vayala@example.net,+971-6197234258,"USNS Santiago, FPO AE 80872",2025-01-25,Gold,AE,971,Michelle,Kidd
1,2,Brad Newton,taylorcatherine@example.net,+356-5376741158,"38783 Oliver Street, West Kristenborough, MT 9...",2023-07-13,Silver,MT,356,Brad,Newton
2,3,Larry Torres,dsanchez@example.net,+1-8102564505,"6845 Steele Turnpike, West Erikabury, UT 37487",2023-08-18,Bronze,UT,1,Larry,Torres
3,4,Kimberly Price,jessicaknight@example.com,+1-4232229779,"1631 Alexis Meadows, Lake Amanda, CA 75179",2024-12-08,Gold,CA,1,Kimberly,Price
4,5,Matthew Phillips,qwilliams@example.com,+1-2207633522,"2274 Williams Heights Suite 895, Andersonhaven...",2024-02-03,Gold,OR,1,Matthew,Phillips

# Connecting and pushing the updated table to ssms

In [166]:
conn = pyodbc.connect(
    "DRIVER={ODBC Driver 17 for SQL Server};"
    "SERVER=DESKTOP-4H1OBGV\\MSSQLSERVER1;"
    "DATABASE=pythonscenario;"
    "Trusted_Connection=yes;"
)
df.to_sql('customer',con=engine,if_exists='replace',index=False)

50

# Creating the new column for customer_tire

In [167]:
df['customer_tier']= df['loyalty_status'].apply(
lambda x: 0 if x=='Bronze' else 1 if x=='Silver' else 2
)

In [168]:
df['customer_tier']

0      2
1      1
2      0
3      2
4      2
      ..
995    1
996    0
997    0
998    2
999    0
Name: customer_tier, Length: 1000, dtype: int64

# Pushing the updated table to SSMS

In [169]:
df.to_sql('customer',con=engine,if_exists='replace',index=False)

130

In [170]:
df.columns

Index(['customer_id', 'name', 'email', 'phone', 'address', 'registration_date',
       'loyalty_status', 'country_code', 'CallingCode', 'first_name',
       'last_name', 'customer_tier'],
      dtype='object')

# Ordering the columns

In [171]:
new_order=['customer_id', 'name','first_name',
       'last_name',  'email', 'phone', 'address', 'registration_date',
       'loyalty_status', 'customer_tier', 'country_code', 'CallingCode']

In [172]:
df=df[new_order]

In [173]:
df.head()

,customer_id,name,first_name,last_name,email,phone,address,registration_date,loyalty_status,customer_tier,country_code,CallingCode
0,1,Michelle Kidd,Michelle,Kidd,vayala@example.net,+971-6197234258,"USNS Santiago, FPO AE 80872",2025-01-25,Gold,2,AE,971
1,2,Brad Newton,Brad,Newton,taylorcatherine@example.net,+356-5376741158,"38783 Oliver Street, West Kristenborough, MT 9...",2023-07-13,Silver,1,MT,356
2,3,Larry Torres,Larry,Torres,dsanchez@example.net,+1-8102564505,"6845 Steele Turnpike, West Erikabury, UT 37487",2023-08-18,Bronze,0,UT,1
3,4,Kimberly Price,Kimberly,Price,jessicaknight@example.com,+1-4232229779,"1631 Alexis Meadows, Lake Amanda, CA 75179",2024-12-08,Gold,2,CA,1
4,5,Matthew Phillips,Matthew,Phillips,qwilliams@example.com,+1-2207633522,"2274 Williams Heights Suite 895, Andersonhaven...",2024-02-03,Gold,2,OR,1

# Pushing the updated table to SSMS

In [174]:
df.to_sql('customer',con=engine,if_exists='replace',index=False)

130